data/read_write_split_disable_4_with_read_pct_80/test-mysql-run-80-20-175-time-2023-08-22-19-26.txt
run sysbench
check mysql database exists
mysql host 172.16.134.200 connect success!
database mydb exists
/usr/bin/sysbench
cd ./sysbench/src/lua;sysbench --db-driver=mysql --mysql-host=172.16.134.200 --mysql-port=3306 --mysql-user=root --mysql-password=sf2gxx9r --mysql-db=mydb --table_size=2000000 --tables=50 --time=60 --threads=175 --events=0 --percentile=99 --read-percent=80 --write-percent=20 --skip_trx=on --mysql-ignore-errors=1062 --db-ps-mode=disable --report-interval=1 oltp_read_write_pct run
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 175
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 175 tps: 0.00 qps: 15880.81 (r/w/o: 13980.46/1900.34/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 175 tps: 167.10 qps: 15276.95 (r/w/o: 13230.75/2046.20/0.00) lat (ms,99%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 175 tps: 134.00 qps: 12602.10 (r/w/o: 9608.08/2994.02/0.00) lat (ms,99%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 175 tps: 125.00 qps: 11622.88 (r/w/o: 8451.91/3170.97/0.00) lat (ms,99%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 175 tps: 99.00 qps: 13035.27 (r/w/o: 10700.22/2335.05/0.00) lat (ms,99%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 175 tps: 150.00 qps: 13720.92 (r/w/o: 11617.94/2102.99/0.00) lat (ms,99%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 175 tps: 121.00 qps: 12062.99 (r/w/o: 9423.99/2639.00/0.00) lat (ms,99%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 175 tps: 144.00 qps: 13404.00 (r/w/o: 10355.00/3049.00/0.00) lat (ms,99%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 175 tps: 111.00 qps: 13031.03 (r/w/o: 10447.03/2584.01/0.00) lat (ms,99%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 175 tps: 142.00 qps: 13369.97 (r/w/o: 11010.98/2358.99/0.00) lat (ms,99%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 175 tps: 126.00 qps: 12711.04 (r/w/o: 10188.03/2523.01/0.00) lat (ms,99%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 175 tps: 118.00 qps: 11456.98 (r/w/o: 8958.98/2498.00/0.00) lat (ms,99%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 175 tps: 131.00 qps: 13373.03 (r/w/o: 10924.03/2449.01/0.00) lat (ms,99%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 175 tps: 154.00 qps: 13576.94 (r/w/o: 10746.95/2829.99/0.00) lat (ms,99%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 175 tps: 119.00 qps: 12195.00 (r/w/o: 9349.00/2846.00/0.00) lat (ms,99%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 175 tps: 100.00 qps: 12349.06 (r/w/o: 10104.05/2245.01/0.00) lat (ms,99%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 175 tps: 140.00 qps: 12500.93 (r/w/o: 10653.94/1846.99/0.00) lat (ms,99%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 175 tps: 121.00 qps: 12069.03 (r/w/o: 9117.02/2952.01/0.00) lat (ms,99%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 175 tps: 106.00 qps: 11680.89 (r/w/o: 8895.92/2784.97/0.00) lat (ms,99%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 175 tps: 132.00 qps: 12951.14 (r/w/o: 10924.12/2027.02/0.00) lat (ms,99%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 175 tps: 141.00 qps: 13848.01 (r/w/o: 11569.01/2279.00/0.00) lat (ms,99%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 175 tps: 108.00 qps: 10730.00 (r/w/o: 7849.00/2881.00/0.00) lat (ms,99%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 175 tps: 116.00 qps: 12247.97 (r/w/o: 9657.97/2589.99/0.00) lat (ms,99%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 175 tps: 133.00 qps: 12938.02 (r/w/o: 10908.01/2030.00/0.00) lat (ms,99%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 175 tps: 139.00 qps: 13393.98 (r/w/o: 10631.98/2762.00/0.00) lat (ms,99%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 175 tps: 122.00 qps: 12259.00 (r/w/o: 9487.00/2772.00/0.00) lat (ms,99%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 175 tps: 124.00 qps: 12648.03 (r/w/o: 10100.03/2548.01/0.00) lat (ms,99%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 175 tps: 128.00 qps: 13058.94 (r/w/o: 10581.96/2476.99/0.00) lat (ms,99%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 175 tps: 133.00 qps: 12566.04 (r/w/o: 10327.03/2239.01/0.00) lat (ms,99%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 175 tps: 94.00 qps: 10017.95 (r/w/o: 7604.96/2412.99/0.00) lat (ms,99%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 175 tps: 135.00 qps: 13715.07 (r/w/o: 10865.06/2850.02/0.00) lat (ms,99%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 175 tps: 148.00 qps: 13905.01 (r/w/o: 11803.01/2102.00/0.00) lat (ms,99%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 175 tps: 128.00 qps: 12576.96 (r/w/o: 9724.97/2851.99/0.00) lat (ms,99%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 175 tps: 124.00 qps: 11748.93 (r/w/o: 8876.95/2871.98/0.00) lat (ms,99%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 175 tps: 112.00 qps: 13267.93 (r/w/o: 11094.94/2172.99/0.00) lat (ms,99%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 175 tps: 150.00 qps: 13325.15 (r/w/o: 10940.12/2385.03/0.00) lat (ms,99%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 175 tps: 115.00 qps: 12236.96 (r/w/o: 9585.97/2650.99/0.00) lat (ms,99%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 175 tps: 115.00 qps: 11914.07 (r/w/o: 8940.05/2974.02/0.00) lat (ms,99%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 175 tps: 136.00 qps: 13483.95 (r/w/o: 11510.96/1972.99/0.00) lat (ms,99%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 175 tps: 136.00 qps: 12794.02 (r/w/o: 10339.02/2455.00/0.00) lat (ms,99%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 175 tps: 124.00 qps: 12222.05 (r/w/o: 9238.04/2984.01/0.00) lat (ms,99%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 175 tps: 108.00 qps: 12102.88 (r/w/o: 9911.90/2190.98/0.00) lat (ms,99%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 175 tps: 134.00 qps: 12971.10 (r/w/o: 10632.08/2339.02/0.00) lat (ms,99%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 175 tps: 135.00 qps: 13453.94 (r/w/o: 10819.95/2633.99/0.00) lat (ms,99%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 175 tps: 126.00 qps: 12751.05 (r/w/o: 9797.04/2954.01/0.00) lat (ms,99%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 175 tps: 127.00 qps: 12537.00 (r/w/o: 9973.00/2564.00/0.00) lat (ms,99%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 175 tps: 132.00 qps: 13525.02 (r/w/o: 10900.02/2625.00/0.00) lat (ms,99%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 175 tps: 136.00 qps: 13421.98 (r/w/o: 11132.98/2289.00/0.00) lat (ms,99%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 175 tps: 142.00 qps: 12591.96 (r/w/o: 9520.97/3070.99/0.00) lat (ms,99%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 175 tps: 108.00 qps: 12945.03 (r/w/o: 10374.02/2571.01/0.00) lat (ms,99%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 175 tps: 152.00 qps: 14708.09 (r/w/o: 12146.07/2562.02/0.00) lat (ms,99%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 175 tps: 135.00 qps: 13088.96 (r/w/o: 10402.97/2685.99/0.00) lat (ms,99%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 175 tps: 135.00 qps: 12920.95 (r/w/o: 9838.96/3081.99/0.00) lat (ms,99%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 175 tps: 120.00 qps: 13148.00 (r/w/o: 10873.00/2275.00/0.00) lat (ms,99%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 175 tps: 144.00 qps: 14093.02 (r/w/o: 11423.02/2670.00/0.00) lat (ms,99%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 175 tps: 131.00 qps: 12944.99 (r/w/o: 10385.99/2559.00/0.00) lat (ms,99%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 175 tps: 105.00 qps: 11390.02 (r/w/o: 8736.02/2654.01/0.00) lat (ms,99%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 175 tps: 132.00 qps: 12803.98 (r/w/o: 10665.99/2138.00/0.00) lat (ms,99%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 175 tps: 137.00 qps: 12164.95 (r/w/o: 9546.96/2617.99/0.00) lat (ms,99%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 175 tps: 98.00 qps: 11299.08 (r/w/o: 8790.06/2509.02/0.00) lat (ms,99%): 1869.60 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            617040
        write:                           154260
        other:                           0
        total:                           771300
    transactions:                        7713   (127.73 per sec.)
    queries:                             771300 (12772.80 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.3849s
    total number of events:              7713

Latency (ms):
         min:                                  407.83
         avg:                                 1366.46
         max:                                 2373.41
         99th percentile:                     1836.24
         sum:                             10539534.43

Threads fairness:
    events (avg/stddev):           44.0743/0.83
    execution time (avg/stddev):   60.2259/0.10